layer {
    name: "data"
    type: "HDF5Data"
    top: "data"
    top: "label"
    hdf5_data_param {
        source: "/home/gipadmin/forks/twerdster/caffe-gui-tool/patch_beltrami/PBSolve_multi/DataTrain.txt"
        batch_size: 16
        shuffle: 0
    }
    include {
        phase: TRAIN
    }
}
layer {
    name: "data"
    type: "HDF5Data"
    top: "data"
    top: "label"
    hdf5_data_param {
        source: "/home/gipadmin/forks/twerdster/caffe-gui-tool/patch_beltrami/PBSolve_multi/DataTest.txt"
        batch_size: 16
        shuffle: 0
    }
    include {
        phase: TEST
    }
}
layer {
    name: "padIx"
    type: "Padding"
    top: "padIx"
    bottom: "data"
    padding_param {
        pad_method: REPEAT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Ix"
    type: "Convolution"
    top: "Ix"
    bottom: "padIx"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Ix2"
    type: "Power"
    top: "Ix2"
    bottom: "Ix"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "g11"
    type: "Convolution"
    top: "g11"
    bottom: "Ix2"
    param {
        name: "gshrw0"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    param {
        name: "gshrb0"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 1
        group: 10
        pad: 5
        kernel_size: 11
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "constant"
            value: 1.000000
        }
    }
}
layer {
    name: "padIy"
    type: "Padding"
    top: "padIy"
    bottom: "data"
    padding_param {
        pad_method: REPEAT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Iy"
    type: "Convolution"
    top: "Iy"
    bottom: "padIy"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Iy2"
    type: "Power"
    top: "Iy2"
    bottom: "Iy"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "g22"
    type: "Convolution"
    top: "g22"
    bottom: "Iy2"
    param {
        name: "gshrw0"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    param {
        name: "gshrb0"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 1
        group: 10
        pad: 5
        kernel_size: 11
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "constant"
            value: 1.000000
        }
    }
}
layer {
    name: "g11g22"
    type: "Eltwise"
    top: "g11g22"
    bottom: "g11"
    bottom: "g22"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "IxIy"
    type: "Eltwise"
    top: "IxIy"
    bottom: "Ix"
    bottom: "Iy"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "g12"
    type: "Convolution"
    top: "g12"
    bottom: "IxIy"
    param {
        name: "gshrw0"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 0
        group: 10
        pad: 5
        kernel_size: 11
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Ixg12"
    type: "Eltwise"
    top: "Ixg12"
    bottom: "Ix"
    bottom: "g12"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "g12_sqrd"
    type: "Power"
    top: "g12_sqrd"
    bottom: "g12"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "detG"
    type: "Eltwise"
    top: "detG"
    bottom: "g11g22"
    bottom: "g12_sqrd"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: -1.000000
    }
}
layer {
    name: "gm05"
    type: "Power"
    top: "gm05"
    bottom: "detG"
    power_param {
        power: -0.500000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "Collector"
    type: "Convolution"
    top: "Dpx0"
    bottom: "gm05"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Iyg11"
    type: "Eltwise"
    top: "Iyg11"
    bottom: "g11"
    bottom: "Iy"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Iyg11_sub_Ixg12.002"
    type: "Eltwise"
    top: "Iyg11_sub_Ixg12"
    bottom: "Ixg12"
    bottom: "Iyg11"
    eltwise_param {
        operation: SUM
        coeff: -1.000000
        coeff: 1.000000
    }
}
layer {
    name: "Iyg11_sub_Ixg12.001"
    type: "Eltwise"
    top: "gm05_mul_Iyg11_sub_Ixg12"
    bottom: "gm05"
    bottom: "Iyg11_sub_Ixg12"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "padDpy"
    type: "Padding"
    top: "padDpy"
    bottom: "gm05_mul_Iyg11_sub_Ixg12"
    padding_param {
        pad_method: CONSTANT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Dpy"
    type: "Convolution"
    top: "Dpy"
    bottom: "padDpy"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Iyg12"
    type: "Eltwise"
    top: "Iyg12"
    bottom: "g12"
    bottom: "Iy"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Ixg22"
    type: "Eltwise"
    top: "Ixg22"
    bottom: "Ix"
    bottom: "g22"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Ixg22_sub_Iyg12.001"
    type: "Eltwise"
    top: "Ixg22_sub_Iyg12"
    bottom: "Ixg22"
    bottom: "Iyg12"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: -1.000000
    }
}
layer {
    name: "gm05_mul_Ixg22_sub_Iyg12"
    type: "Eltwise"
    top: "gm05_mul_Ixg22_sub_Iyg12"
    bottom: "Ixg22_sub_Iyg12"
    bottom: "gm05"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "padDpx"
    type: "Padding"
    top: "padDpx"
    bottom: "gm05_mul_Ixg22_sub_Iyg12"
    padding_param {
        pad_method: CONSTANT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Dpx"
    type: "Convolution"
    top: "Dpx"
    bottom: "padDpx"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "div_invG_gradI.001"
    type: "Eltwise"
    top: "div_invG_gradI"
    bottom: "Dpx"
    bottom: "Dpy"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: 1.000000
    }
}
layer {
    name: "gradient"
    type: "Eltwise"
    top: "output_flow"
    bottom: "div_invG_gradI"
    bottom: "Dpx0"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "dt_mul_grad"
    type: "Convolution"
    top: "dt_mul_grad"
    bottom: "output_flow"
    param {
        name: "dt_mul_grad_shrW"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad: 0
        kernel_size: 1
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "c"
    type: "Eltwise"
    top: "finalOutput"
    bottom: "dt_mul_grad"
    bottom: "data"
    eltwise_param {
        operation: SUM
        coeff: 1000.000000
        coeff: 1.000000
    }
}
layer {
    name: "padIx.001"
    type: "Padding"
    top: "padIx0"
    bottom: "finalOutput"
    padding_param {
        pad_method: REPEAT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Ix.001"
    type: "Convolution"
    top: "Ix0"
    bottom: "padIx0"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Ix2.001"
    type: "Power"
    top: "Ix20"
    bottom: "Ix0"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "g11.001"
    type: "Convolution"
    top: "g110"
    bottom: "Ix20"
    param {
        name: "gshrw01"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    param {
        name: "gshrb01"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 1
        group: 10
        pad: 5
        kernel_size: 11
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "constant"
            value: 1.000000
        }
    }
}
layer {
    name: "padIy.001"
    type: "Padding"
    top: "padIy0"
    bottom: "finalOutput"
    padding_param {
        pad_method: REPEAT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Iy.001"
    type: "Convolution"
    top: "Iy0"
    bottom: "padIy0"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Iyg11.001"
    type: "Eltwise"
    top: "Iyg110"
    bottom: "g110"
    bottom: "Iy0"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Iy2.001"
    type: "Power"
    top: "Iy20"
    bottom: "Iy0"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "g22.001"
    type: "Convolution"
    top: "g220"
    bottom: "Iy20"
    param {
        name: "gshrw01"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    param {
        name: "gshrb01"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 1
        group: 10
        pad: 5
        kernel_size: 11
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "constant"
            value: 1.000000
        }
    }
}
layer {
    name: "Ixg22.001"
    type: "Eltwise"
    top: "Ixg220"
    bottom: "Ix0"
    bottom: "g220"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "g11g22.001"
    type: "Eltwise"
    top: "g11g220"
    bottom: "g110"
    bottom: "g220"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "IxIy.001"
    type: "Eltwise"
    top: "IxIy0"
    bottom: "Ix0"
    bottom: "Iy0"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "g12.001"
    type: "Convolution"
    top: "g120"
    bottom: "IxIy0"
    param {
        name: "gshrw01"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 0
        group: 10
        pad: 5
        kernel_size: 11
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Iyg12.001"
    type: "Eltwise"
    top: "Iyg120"
    bottom: "g120"
    bottom: "Iy0"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Ixg22_sub_Iyg12.002"
    type: "Eltwise"
    top: "Ixg22_sub_Iyg120"
    bottom: "Ixg220"
    bottom: "Iyg120"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: -1.000000
    }
}
layer {
    name: "Ixg12.001"
    type: "Eltwise"
    top: "Ixg120"
    bottom: "Ix0"
    bottom: "g120"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Iyg11_sub_Ixg12.003"
    type: "Eltwise"
    top: "Iyg11_sub_Ixg120"
    bottom: "Ixg120"
    bottom: "Iyg110"
    eltwise_param {
        operation: SUM
        coeff: -1.000000
        coeff: 1.000000
    }
}
layer {
    name: "g12_sqrd.001"
    type: "Power"
    top: "g12_sqrd0"
    bottom: "g120"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "detG.001"
    type: "Eltwise"
    top: "detG0"
    bottom: "g11g220"
    bottom: "g12_sqrd0"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: -1.000000
    }
}
layer {
    name: "gm05.001"
    type: "Power"
    top: "gm050"
    bottom: "detG0"
    power_param {
        power: -0.500000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "Collector.001"
    type: "Convolution"
    top: "Dpx00"
    bottom: "gm050"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Iyg11_sub_Ixg12.004"
    type: "Eltwise"
    top: "gm05_mul_Iyg11_sub_Ixg120"
    bottom: "gm050"
    bottom: "Iyg11_sub_Ixg120"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "padDpy.001"
    type: "Padding"
    top: "padDpy0"
    bottom: "gm05_mul_Iyg11_sub_Ixg120"
    padding_param {
        pad_method: CONSTANT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Dpy.001"
    type: "Convolution"
    top: "Dpy0"
    bottom: "padDpy0"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "gm05_mul_Ixg22_sub_Iyg12.001"
    type: "Eltwise"
    top: "gm05_mul_Ixg22_sub_Iyg120"
    bottom: "Ixg22_sub_Iyg120"
    bottom: "gm050"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "padDpx.0012"
    type: "Padding"
    top: "padDpx0"
    bottom: "gm05_mul_Ixg22_sub_Iyg120"
    padding_param {
        pad_method: CONSTANT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Dpx.001"
    type: "Convolution"
    top: "Dpx000"
    bottom: "padDpx0"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "div_invG_gradI.002"
    type: "Eltwise"
    top: "div_invG_gradI0"
    bottom: "Dpx000"
    bottom: "Dpy0"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: 1.000000
    }
}
layer {
    name: "gradient.001"
    type: "Eltwise"
    top: "output_flow0"
    bottom: "div_invG_gradI0"
    bottom: "Dpx00"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "dt_mul_grad.001"
    type: "Convolution"
    top: "dt_mul_grad0"
    bottom: "output_flow0"
    param {
        name: "dt_mul_grad_shrW1"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad: 0
        kernel_size: 1
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "c.001"
    type: "Eltwise"
    top: "finalOutput0"
    bottom: "dt_mul_grad0"
    bottom: "finalOutput"
    eltwise_param {
        operation: SUM
        coeff: 1000.000000
        coeff: 1.000000
    }
}
layer {
    name: "padIx.002"
    type: "Padding"
    top: "padIx00"
    bottom: "finalOutput0"
    padding_param {
        pad_method: REPEAT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Ix.002"
    type: "Convolution"
    top: "Ix00"
    bottom: "padIx00"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Ix2.002"
    type: "Power"
    top: "Ix200"
    bottom: "Ix00"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "g11.002"
    type: "Convolution"
    top: "g1100"
    bottom: "Ix200"
    param {
        name: "gshrw02"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    param {
        name: "gshrb02"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 1
        group: 10
        pad: 5
        kernel_size: 11
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "constant"
            value: 1.000000
        }
    }
}
layer {
    name: "padIy.002"
    type: "Padding"
    top: "padIy00"
    bottom: "finalOutput0"
    padding_param {
        pad_method: REPEAT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Iy.002"
    type: "Convolution"
    top: "Iy00"
    bottom: "padIy00"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Iyg11.002"
    type: "Eltwise"
    top: "Iyg1100"
    bottom: "g1100"
    bottom: "Iy00"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Iy2.002"
    type: "Power"
    top: "Iy200"
    bottom: "Iy00"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "g22.002"
    type: "Convolution"
    top: "g2200"
    bottom: "Iy200"
    param {
        name: "gshrw02"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    param {
        name: "gshrb02"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 1
        group: 10
        pad: 5
        kernel_size: 11
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "constant"
            value: 1.000000
        }
    }
}
layer {
    name: "Ixg22.002"
    type: "Eltwise"
    top: "Ixg2200"
    bottom: "Ix00"
    bottom: "g2200"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "g11g22.002"
    type: "Eltwise"
    top: "g11g2200"
    bottom: "g1100"
    bottom: "g2200"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "IxIy.002"
    type: "Eltwise"
    top: "IxIy00"
    bottom: "Ix00"
    bottom: "Iy00"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "g12.002"
    type: "Convolution"
    top: "g1200"
    bottom: "IxIy00"
    param {
        name: "gshrw02"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 0
        group: 10
        pad: 5
        kernel_size: 11
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Iyg12.002"
    type: "Eltwise"
    top: "Iyg1200"
    bottom: "g1200"
    bottom: "Iy00"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Ixg22_sub_Iyg12.003"
    type: "Eltwise"
    top: "Ixg22_sub_Iyg1200"
    bottom: "Ixg2200"
    bottom: "Iyg1200"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: -1.000000
    }
}
layer {
    name: "Ixg12.002"
    type: "Eltwise"
    top: "Ixg1200"
    bottom: "Ix00"
    bottom: "g1200"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Iyg11_sub_Ixg12.005"
    type: "Eltwise"
    top: "Iyg11_sub_Ixg1200"
    bottom: "Ixg1200"
    bottom: "Iyg1100"
    eltwise_param {
        operation: SUM
        coeff: -1.000000
        coeff: 1.000000
    }
}
layer {
    name: "g12_sqrd.002"
    type: "Power"
    top: "g12_sqrd00"
    bottom: "g1200"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "detG.002"
    type: "Eltwise"
    top: "detG00"
    bottom: "g11g2200"
    bottom: "g12_sqrd00"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: -1.000000
    }
}
layer {
    name: "gm05.002"
    type: "Power"
    top: "gm05001"
    bottom: "detG00"
    power_param {
        power: -0.500000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "Collector.0022"
    type: "Convolution"
    top: "Dpx0001"
    bottom: "gm05001"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Iyg11_sub_Ixg12.006"
    type: "Eltwise"
    top: "gm05_mul_Iyg11_sub_Ixg1200"
    bottom: "gm05001"
    bottom: "Iyg11_sub_Ixg1200"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "padDpy.002"
    type: "Padding"
    top: "padDpy00"
    bottom: "gm05_mul_Iyg11_sub_Ixg1200"
    padding_param {
        pad_method: CONSTANT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Dpy.002"
    type: "Convolution"
    top: "Dpy00"
    bottom: "padDpy00"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "gm05_mul_Ixg22_sub_Iyg12.002"
    type: "Eltwise"
    top: "gm05_mul_Ixg22_sub_Iyg1200"
    bottom: "Ixg22_sub_Iyg1200"
    bottom: "gm05001"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "padDpx.013"
    type: "Padding"
    top: "padDpx00"
    bottom: "gm05_mul_Ixg22_sub_Iyg1200"
    padding_param {
        pad_method: CONSTANT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Dpx.002"
    type: "Convolution"
    top: "Dpx0000"
    bottom: "padDpx00"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "div_invG_gradI.003"
    type: "Eltwise"
    top: "div_invG_gradI00"
    bottom: "Dpx0000"
    bottom: "Dpy00"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: 1.000000
    }
}
layer {
    name: "gradient.0022"
    type: "Eltwise"
    top: "output_flow001"
    bottom: "div_invG_gradI00"
    bottom: "Dpx0001"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "dt_mul_grad.0022"
    type: "Convolution"
    top: "dt_mul_grad001"
    bottom: "output_flow001"
    param {
        name: "dt_mul_grad_shrW2"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad: 0
        kernel_size: 1
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "c.002"
    type: "Eltwise"
    top: "finalOutput00"
    bottom: "dt_mul_grad001"
    bottom: "finalOutput0"
    eltwise_param {
        operation: SUM
        coeff: 1000.000000
        coeff: 1.000000
    }
}
layer {
    name: "padIx.003"
    type: "Padding"
    top: "padIx000"
    bottom: "finalOutput00"
    padding_param {
        pad_method: REPEAT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Ix.003"
    type: "Convolution"
    top: "Ix000"
    bottom: "padIx000"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Ix2.003"
    type: "Power"
    top: "Ix2000"
    bottom: "Ix000"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "g11.003"
    type: "Convolution"
    top: "g11000"
    bottom: "Ix2000"
    param {
        name: "gshrw03"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    param {
        name: "gshrb03"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 1
        group: 10
        pad: 5
        kernel_size: 11
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "constant"
            value: 1.000000
        }
    }
}
layer {
    name: "padIy.003"
    type: "Padding"
    top: "padIy000"
    bottom: "finalOutput00"
    padding_param {
        pad_method: REPEAT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Iy.003"
    type: "Convolution"
    top: "Iy000"
    bottom: "padIy000"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Iyg11.003"
    type: "Eltwise"
    top: "Iyg11000"
    bottom: "g11000"
    bottom: "Iy000"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Iy2.003"
    type: "Power"
    top: "Iy2000"
    bottom: "Iy000"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "g22.003"
    type: "Convolution"
    top: "g22000"
    bottom: "Iy2000"
    param {
        name: "gshrw03"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    param {
        name: "gshrb03"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 1
        group: 10
        pad: 5
        kernel_size: 11
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "constant"
            value: 1.000000
        }
    }
}
layer {
    name: "Ixg22.003"
    type: "Eltwise"
    top: "Ixg22000"
    bottom: "Ix000"
    bottom: "g22000"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "g11g22.003"
    type: "Eltwise"
    top: "g11g22000"
    bottom: "g11000"
    bottom: "g22000"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "IxIy.003"
    type: "Eltwise"
    top: "IxIy000"
    bottom: "Ix000"
    bottom: "Iy000"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "g12.003"
    type: "Convolution"
    top: "g12000"
    bottom: "IxIy000"
    param {
        name: "gshrw03"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 10
        bias_term: 0
        group: 10
        pad: 5
        kernel_size: 11
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Iyg12.003"
    type: "Eltwise"
    top: "Iyg12000"
    bottom: "g12000"
    bottom: "Iy000"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Ixg22_sub_Iyg12.004"
    type: "Eltwise"
    top: "Ixg22_sub_Iyg12000"
    bottom: "Ixg22000"
    bottom: "Iyg12000"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: -1.000000
    }
}
layer {
    name: "Ixg12.003"
    type: "Eltwise"
    top: "Ixg12000"
    bottom: "Ix000"
    bottom: "g12000"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Iyg11_sub_Ixg12.007"
    type: "Eltwise"
    top: "Iyg11_sub_Ixg12000"
    bottom: "Ixg12000"
    bottom: "Iyg11000"
    eltwise_param {
        operation: SUM
        coeff: -1.000000
        coeff: 1.000000
    }
}
layer {
    name: "g12_sqrd.003"
    type: "Power"
    top: "g12_sqrd000"
    bottom: "g12000"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "detG.003"
    type: "Eltwise"
    top: "detG000"
    bottom: "g11g22000"
    bottom: "g12_sqrd000"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: -1.000000
    }
}
layer {
    name: "gm05.003"
    type: "Power"
    top: "gm050010"
    bottom: "detG000"
    power_param {
        power: -0.500000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "Collector.023"
    type: "Convolution"
    top: "Dpx00010"
    bottom: "gm050010"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 1
        kernel_w: 1
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Iyg11_sub_Ixg12.008"
    type: "Eltwise"
    top: "gm05_mul_Iyg11_sub_Ixg12000"
    bottom: "gm050010"
    bottom: "Iyg11_sub_Ixg12000"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "padDpy.003"
    type: "Padding"
    top: "padDpy000"
    bottom: "gm05_mul_Iyg11_sub_Ixg12000"
    padding_param {
        pad_method: CONSTANT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Dpy.003"
    type: "Convolution"
    top: "Dpy000"
    bottom: "padDpy000"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "gm05_mul_Ixg22_sub_Iyg12.003"
    type: "Eltwise"
    top: "gm05_mul_Ixg22_sub_Iyg12000"
    bottom: "Ixg22_sub_Iyg12000"
    bottom: "gm050010"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "padDpx.014"
    type: "Padding"
    top: "padDpx000"
    bottom: "gm05_mul_Ixg22_sub_Iyg12000"
    padding_param {
        pad_method: CONSTANT
        pad_l: 2
        pad_r: 2
        pad_t: 2
        pad_b: 2
        pad_value: 0.000000
    }
}
layer {
    name: "Dpx.003"
    type: "Convolution"
    top: "Dpx00000"
    bottom: "padDpx000"
    param {
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad_h: 0
        pad_w: 0
        kernel_h: 5
        kernel_w: 5
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "div_invG_gradI.004"
    type: "Eltwise"
    top: "div_invG_gradI000"
    bottom: "Dpx00000"
    bottom: "Dpy000"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: 1.000000
    }
}
layer {
    name: "gradient.023"
    type: "Eltwise"
    top: "output_flow0010"
    bottom: "div_invG_gradI000"
    bottom: "Dpx00010"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "dt_mul_grad.023"
    type: "Convolution"
    top: "dt_mul_grad0010"
    bottom: "output_flow0010"
    param {
        name: "dt_mul_grad_shrW2"
        lr_mult: 1.000000
        decay_mult: 1.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad: 0
        kernel_size: 1
        stride: 1
        weight_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "c.003"
    type: "Eltwise"
    top: "finalOutput000"
    bottom: "dt_mul_grad0010"
    bottom: "finalOutput00"
    eltwise_param {
        operation: SUM
        coeff: 1000.000000
        coeff: 1.000000
    }
}
layer {
    name: "MRE"
    type: "EuclideanLoss"
    top: "MRE"
    bottom: "finalOutput000"
    bottom: "label"
    loss_weight: 1.000000
}
