layer {
    name: "data"
    type: "HDF5Data"
    top: "data"
    top: "label"
    hdf5_data_param {
        source: "/home/gipadmin/forks/caffe-gui-tool/patch_beltrami/data.txt"
        batch_size: 1
        shuffle: 0
    }
    include {
        phase: TRAIN
    }
}
layer {
    name: "data"
    type: "HDF5Data"
    top: "data"
    top: "label"
    hdf5_data_param {
        source: "/home/gipadmin/forks/caffe-gui-tool/patch_beltrami/data.txt"
        batch_size: 1
        shuffle: 0
    }
    include {
        phase: TEST
    }
}
layer {
    name: "Iy"
    type: "Convolution"
    top: "Iy"
    bottom: "data"
    param {
        lr_mult: 0.000000
        decay_mult: 0.000000
    }
    convolution_param {
        num_output: 3
        bias_term: 0
        group: 3
        pad_h: 1
        pad_w: 0
        kernel_h: 3
        kernel_w: 1
        stride: 1
    }
    blobs {
        shape {
            dim: 3
            dim: 1
            dim: 3
            dim: 1
        }
        data: -1.0
        data:  1.0
        data:  0.0
        data: -1.0
        data:  1.0
        data:  0.0
        data: -1.0
        data:  1.0
        data:  0.0
    }
}
layer {
    name: "Ix"
    type: "Convolution"
    top: "Ix"
    bottom: "data"
    param {
        lr_mult: 0.000000
        decay_mult: 0.000000
    }
    convolution_param {
        num_output: 3
        bias_term: 0
        group: 3
        pad_h: 0
        pad_w: 1
        kernel_h: 1
        kernel_w: 3
        stride: 1
    }
    blobs {
        shape {
            dim: 3
            dim: 1
            dim: 1
            dim: 3
        }
        data: -1.0
        data:  1.0
        data:  0.0
        data: -1.0
        data:  1.0
        data:  0.0
        data: -1.0
        data:  1.0
        data:  0.0
    }
}
layer {
    name: "Ix2"
    type: "Power"
    top: "Ix2"
    bottom: "Ix"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "g11"
    type: "Convolution"
    top: "g11"
    bottom: "Ix2"
    param {
        lr_mult: 0.000000
        decay_mult: 0.000000
    }
    param {
        lr_mult: 0.000000
        decay_mult: 0.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 1
        group: 1
        pad: 0
        kernel_size: 1
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "constant"
            value: 5570.000000
        }
    }
}
layer {
    name: "g11_"
    type: "Convolution"
    top: "g11_rep3"
    bottom: "g11"
    param {
        lr_mult: 0.000000
        decay_mult: 0.000000
    }
    convolution_param {
        num_output: 3
        bias_term: 0
        group: 1
        pad: 0
        kernel_size: 1
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "HDF 5 Output Node"
    type: "HDF5Output"
    bottom: "Ix"
    bottom: "label"
    hdf5_output_param {
        file_name: "/home/gipadmin/forks/caffe-gui-tool/patch_beltrami/Ix.h5"
    }
    include {
        phase: TRAIN
    }
}
layer {
    name: "output"
    type: "HDF5Output"
    bottom: "Ix2"
    bottom: "label"
    hdf5_output_param {
        file_name: "/home/gipadmin/forks/caffe-gui-tool/patch_beltrami/Ix2.h5"
    }
    include {
        phase: TRAIN
    }
}
layer {
    name: "Iyg11"
    type: "Eltwise"
    top: "Iyg11"
    bottom: "g11_rep3"
    bottom: "Iy"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Iy2"
    type: "Power"
    top: "Iy2"
    bottom: "Iy"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "g22"
    type: "Convolution"
    top: "g22"
    bottom: "Iy2"
    param {
        lr_mult: 0.000000
        decay_mult: 0.000000
    }
    param {
        lr_mult: 0.000000
        decay_mult: 0.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 1
        group: 1
        pad: 0
        kernel_size: 1
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "constant"
            value: 5570.000000
        }
    }
}
layer {
    name: "g22_"
    type: "Convolution"
    top: "g22_rep3"
    bottom: "g22"
    param {
        lr_mult: 0.000000
        decay_mult: 0.000000
    }
    convolution_param {
        num_output: 3
        bias_term: 0
        group: 1
        pad: 0
        kernel_size: 1
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Ixg22"
    type: "Eltwise"
    top: "Ixg22"
    bottom: "Ix"
    bottom: "g22_rep3"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "g11g22"
    type: "Eltwise"
    top: "g11g22"
    bottom: "g11"
    bottom: "g22"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "IxIy"
    type: "Eltwise"
    top: "IxIy"
    bottom: "Ix"
    bottom: "Iy"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "g12"
    type: "Convolution"
    top: "g12"
    bottom: "IxIy"
    param {
        lr_mult: 0.000000
        decay_mult: 0.000000
    }
    convolution_param {
        num_output: 1
        bias_term: 0
        group: 1
        pad: 0
        kernel_size: 1
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "g12_"
    type: "Convolution"
    top: "g12_rep3"
    bottom: "g12"
    param {
        lr_mult: 0.000000
        decay_mult: 0.000000
    }
    convolution_param {
        num_output: 3
        bias_term: 0
        group: 1
        pad: 0
        kernel_size: 1
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Ixg12"
    type: "Eltwise"
    top: "Ixg12"
    bottom: "Ix"
    bottom: "g12_rep3"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Iyg11_sub_Ixg12.002"
    type: "Eltwise"
    top: "Iyg11_sub_Ixg12"
    bottom: "Ixg12"
    bottom: "Iyg11"
    eltwise_param {
        operation: SUM
        coeff: -1.000000
        coeff: 1.000000
    }
}
layer {
    name: "Iyg12"
    type: "Eltwise"
    top: "Iyg12"
    bottom: "g12_rep3"
    bottom: "Iy"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Ixg22_sub_Iyg12.001"
    type: "Eltwise"
    top: "Ixg22_sub_Iyg12"
    bottom: "Ixg22"
    bottom: "Iyg12"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: -1.000000
    }
}
layer {
    name: "g12_sqrd"
    type: "Power"
    top: "g12_sqrd"
    bottom: "g12"
    power_param {
        power: 2.000000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "detG"
    type: "Eltwise"
    top: "detG"
    bottom: "g11g22"
    bottom: "g12_sqrd"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: -1.000000
    }
}
layer {
    name: "gm05"
    type: "Power"
    top: "gm05"
    bottom: "detG"
    power_param {
        power: -0.500000
        scale: 1.000000
        shift: 0.000000
    }
}
layer {
    name: "gm05_"
    type: "Convolution"
    top: "gm05_rep3"
    bottom: "gm05"
    param {
        lr_mult: 0.000000
        decay_mult: 0.000000
    }
    convolution_param {
        num_output: 3
        bias_term: 0
        group: 1
        pad: 0
        kernel_size: 1
        stride: 1
        weight_filler {
            type: "constant"
            value: 1.000000
        }
        bias_filler {
            type: "xavier"
            variance_norm: FAN_IN
        }
    }
}
layer {
    name: "Iyg11_sub_Ixg12.001"
    type: "Eltwise"
    top: "gm05_mul_Iyg11_sub_Ixg12"
    bottom: "gm05_rep3"
    bottom: "Iyg11_sub_Ixg12"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Dpy"
    type: "Convolution"
    top: "Dpy"
    bottom: "gm05_mul_Iyg11_sub_Ixg12"
    param {
        lr_mult: 0.000000
        decay_mult: 0.000000
    }
    convolution_param {
        num_output: 3
        bias_term: 0
        group: 3
        pad_h: 1
        pad_w: 0
        kernel_h: 3
        kernel_w: 1
        stride: 1
    }
    blobs {
        shape {
            dim: 3
            dim: 1
            dim: 3
            dim: 1
        }
        data:  0.0
        data: -1.0
        data:  1.0
        data:  0.0
        data: -1.0
        data:  1.0
        data:  0.0
        data: -1.0
        data:  1.0
    }
}
layer {
    name: "gm05_mul_Ixg22_sub_Iyg12"
    type: "Eltwise"
    top: "gm05_mul_Ixg22_sub_Iyg12"
    bottom: "Ixg22_sub_Iyg12"
    bottom: "gm05_rep3"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "Dpx"
    type: "Convolution"
    top: "Dpx"
    bottom: "gm05_mul_Ixg22_sub_Iyg12"
    param {
        lr_mult: 0.000000
        decay_mult: 0.000000
    }
    convolution_param {
        num_output: 3
        bias_term: 0
        group: 3
        pad_h: 0
        pad_w: 1
        kernel_h: 1
        kernel_w: 3
        stride: 1
    }
    blobs {
        shape {
            dim: 3
            dim: 1
            dim: 1
            dim: 3
        }
        data:  0.0
        data: -1.0
        data:  1.0
        data:  0.0
        data: -1.0
        data:  1.0
        data:  0.0
        data: -1.0
        data:  1.0
    }
}
layer {
    name: "div_invG_gradI.001"
    type: "Eltwise"
    top: "div_invG_gradI"
    bottom: "Dpx"
    bottom: "Dpy"
    eltwise_param {
        operation: SUM
        coeff: 1.000000
        coeff: 1.000000
    }
}
layer {
    name: "output_flow"
    type: "Eltwise"
    top: "output_flow"
    bottom: "div_invG_gradI"
    bottom: "gm05_rep3"
    eltwise_param {
        operation: PROD
        stable_prod_grad: 1
    }
}
layer {
    name: "HDF 5 Output Node.002"
    type: "HDF5Output"
    bottom: "detG"
    bottom: "label"
    hdf5_output_param {
        file_name: "/home/gipadmin/forks/caffe-gui-tool/patch_beltrami/detg.h5"
    }
    include {
        phase: TRAIN
    }
}
layer {
    name: "HDF 5 Output Node.001"
    type: "HDF5Output"
    bottom: "gm05"
    bottom: "label"
    hdf5_output_param {
        file_name: "/home/gipadmin/forks/caffe-gui-tool/patch_beltrami/gm05.h5"
    }
    include {
        phase: TRAIN
    }
}
layer {
    name: "Silence Node"
    type: "Silence"
    bottom: "output_flow"
}
layer {
    name: "HDF 5 Output Node.003"
    type: "HDF5Output"
    bottom: "output_flow"
    bottom: "output_flow"
    hdf5_output_param {
        file_name: "/home/gipadmin/forks/caffe-gui-tool/patch_beltrami/output.h5"
    }
    include {
        phase: TRAIN
    }
}
